profile/ab.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      100
Time taken for tests:   403.158 seconds
Complete requests:      1000000
Failed requests:        947
   (Connect: 0, Receive: 0, Length: 947, Exceptions: 0)
Write errors:           0
Total transferred:      129005682 bytes
HTML transferred:       12987689 bytes
Requests per second:    2480.42 [#/sec] (mean)
Time per request:       40.316 [ms] (mean)
Time per request:       0.403 [ms] (mean, across all concurrent requests)
Transfer rate:          312.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     2   40  15.7     48     192
Waiting:        2   40  15.7     48     192
Total:          2   40  15.6     48     192

Percentage of the requests served within a certain time (ms)
  50%     48
  66%     49
  75%     50
  80%     50
  90%     52
  95%     57
  98%     73
  99%     76
 100%    192 (longest request)